import { InMemoryDbService } from 'angular-in-memory-web-api';
import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class InMemoryDataService implements InMemoryDbService {
  createDb() {
    const books = [
      {
        id: 1,
        isbn: '978-966-97200-7-8',
        title: 'Плисти проти течії. Том 2',
        subtitle: 'Філософські роздуми',
        author: 'Хорхе Анхель Ліврага',
        year: 2018,
        language: 'українська',
        translatedFrom: 'іспанської',
        pageNumber: 361,
        description: 'Другий том філософських есеїв, статей та лекцій аргентинського філософа Хорхе Анхеля Лівраги буде цікавий тим, хто замислюється над питаннями про сенс життя, природу людини, моральні чесноти, проблему вибору, закони розвитку історії та людства. «Ідеали тіла та ідеали душі», «Іти поміж мертвих», «Внутрішнє дзеркало», «Хвороби сучасного світу», «Культура безкультурності», «Як здійснюються мрії» — ці та інші есеї автора розкривають погляд сучасного філософа на життя людини та її взаємини зі світом.',
        imgUrl: 'http://newacropolis.org.ua/uploads/production/ckeditor/picture/data/a33/f09/7b-/a33f097b-b856-4081-8cfb-c83aa6aa67e4/content.png',
        price: 300,
        buyButton: 'here will be the link'
      },
      {
        id: 2,
        isbn: '978-966-97200-5-4',
        title: 'Покривало Ізіди',
        subtitle: 'Нарис з історії ідеї Природи',
        author: 'П’єр Адо',
        year: 2016,
        language: 'українська',
        translatedFrom: 'французської',
        pageNumber: 0,
        description: '«Покривало Ізіди» — одна з останніх книг П’єра Адо (1922–2010), задум якої він, за власним зізнанням, виношував більше сорока років. У ній автор розкриває походження численних уявлень про природу і настанов щодо неї, які, на його думку, стали можливими завдяки різним тлумаченням афоризму Геракліта «Природа любить приховуватися», що творять відмінні формули розуміння реальності: «Те, що народжується, схильне зникнути»; «Природа вбирається у чуттєві форми та міфи»; «Природа приховує у собі таємні властивості»; «Буття розкриває себе у приховуванні» тощо. П’єр Адо реконструює таким чином контраверсійну історію ідеї Природи у західній думці, що вже упродовж більш ніж двадцяти п’яти століть розривається між тим, що він називає прометеєвою настановою («людина має опанувати природу і стати її господарем»), та орфічною настановою – «ніхто, окрім поета та митця, не може зазирнути за покривало таємниць Природи». \n' +
          'Книга є рідкісним для нашого часу прикладом синтезу філософського, наукового та мистецького підходів і, у цій якості, буде цікавою широкому інтелектуальному загалу. Книга вперше видана в українському перекладі.',
        imgUrl: 'http://newacropolis.org.ua/uploads/production/ckeditor/picture/data/38c/03e/81-/38c03e81-e909-4198-834d-d7b2a702f571/content.png',
        price: 365,
        buyButton: 'here will be the link'
      }
    ];
    return { books };
  }
}
