import { InMemoryDbService } from 'angular-in-memory-web-api';
import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class InMemoryDataService implements InMemoryDbService {
  createDb() {
    const books = [
      {
        id: 1,
        isbn: '978-966-97200-7-8',
        title: 'Плисти проти течії. Том 2',
        subtitle: 'Філософські роздуми',
        author: 'Хорхе Анхель Ліврага',
        year: 2018,
        language: 'українська',
        translatedFrom: 'іспанської',
        pageNumber: 361,
        description: 'Другий том філософських есеїв, статей та лекцій аргентинського філософа Хорхе Анхеля Лівраги буде цікавий тим, хто замислюється над питаннями про сенс життя, природу людини, моральні чесноти, проблему вибору, закони розвитку історії та людства. «Ідеали тіла та ідеали душі», «Іти поміж мертвих», «Внутрішнє дзеркало», «Хвороби сучасного світу», «Культура безкультурності», «Як здійснюються мрії» — ці та інші есеї автора розкривають погляд сучасного філософа на життя людини та її взаємини зі світом.',
        imgUrl: 'http://newacropolis.org.ua/uploads/production/ckeditor/picture/data/a33/f09/7b-/a33f097b-b856-4081-8cfb-c83aa6aa67e4/content.png',
        price: 300,
        buyButton: true,
        buyLink: 'here will be the link'
      },
      {
        id: 2,
        isbn: '978-966-97200-5-4',
        title: 'Покривало Ізіди',
        subtitle: 'Нарис з історії ідеї Природи',
        author: 'П’єр Адо',
        year: 2016,
        language: 'українська',
        translatedFrom: 'французської',
        pageNumber: 0,
        description: '«Покривало Ізіди» — одна з останніх книг П’єра Адо (1922–2010), задум якої він, за власним зізнанням, виношував більше сорока років. У ній автор розкриває походження численних уявлень про природу і настанов щодо неї, які, на його думку, стали можливими завдяки різним тлумаченням афоризму Геракліта «Природа любить приховуватися», що творять відмінні формули розуміння реальності: «Те, що народжується, схильне зникнути»; «Природа вбирається у чуттєві форми та міфи»; «Природа приховує у собі таємні властивості»; «Буття розкриває себе у приховуванні» тощо. П’єр Адо реконструює таким чином контраверсійну історію ідеї Природи у західній думці, що вже упродовж більш ніж двадцяти п’яти століть розривається між тим, що він називає прометеєвою настановою («людина має опанувати природу і стати її господарем»), та орфічною настановою – «ніхто, окрім поета та митця, не може зазирнути за покривало таємниць Природи». \n' +
          'Книга є рідкісним для нашого часу прикладом синтезу філософського, наукового та мистецького підходів і, у цій якості, буде цікавою широкому інтелектуальному загалу. Книга вперше видана в українському перекладі.',
        imgUrl: 'http://newacropolis.org.ua/uploads/production/ckeditor/picture/data/38c/03e/81-/38c03e81-e909-4198-834d-d7b2a702f571/content.png',
        price: 365,
        buyButton: true,
        buyLink: 'here will be the link'
      },
      {
        id: 3,
        isbn: '978-966-97200-4-7',
        title: 'Сьогодні я бачила...',
        subtitle: '',
        author: 'Делія Стейнберг',
        year: 2016,
        language: 'українська',
        translatedFrom: 'іспанської',
        pageNumber: 0,
        description: '«Сьогодні я бачила...» — книжка особлива. Написана прозою, вона не поступається будь-якому відомому поетичному творові, оскільки її слова напрочуд невимушено заторкують найпотаємніше в кожній людині. Ця книга, написана у жанрі роздумів про наболілі питання сьогодення, виходить за межі часу і простору, в яких ми живемо, бо жоден її фрагмент не можна назвати від- голосом скороминущих уподобань, що так само легко зникають, як і виникають. Отже, перед нами одна з тих незвичайних книг, обкладинка якої мало, а то й нічого нам не говорить, але під нею пульсує цілий світ, геть відмінний від нашого — охмареного песимізмом та безликістю; цілий світ, що, діючи як живодайний бальзам, стає одою життю у кожній з його незліченних форм.',
        imgUrl: 'http://newacropolis.org.ua/uploads/production/ckeditor/picture/data/250/98a/26-/25098a26-5a03-4ff3-8f40-407b182ec6e6/content.png',
        price: 150,
        buyButton: true,
        buyLink: 'here will be the link'
      },
      {
        id: 4,
        isbn: '978-966-97200-3-0',
        title: 'Плисти проти течії',
        subtitle: 'Філософські роздуми',
        author: 'Хорхе Анхель Ліврага',
        year: 2015,
        language: 'українська',
        translatedFrom: 'іспанської',
        pageNumber: 0,
        description: 'Збірка філософських есеїв, статей та лекцій Хорхе Анхеля Лівраги, засновника та першого керівника Міжнародної культурної організації «Новий Акрополь» дає змогу замислитися про сенс життя, мудрість, моральні чесноти, походження людини, Всесвіт і його закони, культуру, історію. Невелика частина творчого доробку видатного філософа, митця та дослідника ХХ століття вперше публікується українською мовою. Видання адресується широкому колу читачів.',
        imgUrl: 'http://newacropolis.org.ua/uploads/production/ckeditor/picture/data/a54/7b1/d9-/a547b1d9-9a0e-427c-96fa-092e89ff9f37/content.png',
        price: 225,
        buyButton: true,
        buyLink: 'here will be the link'
      },
      {
        id: 5,
        isbn: '978-966-97200-2-3',
        title: 'Що таке антична філософія?',
        subtitle: '',
        author: 'П’єр Адо',
        year: 2014,
        language: 'українська',
        translatedFrom: 'французької',
        pageNumber: 0,
        description: 'Твір «Що таке антична філософія?» (1995) посідає особливе місце у творчості П. Адо. Ця книга стала для нього нагодою викласти власну концепцію філософії і, одночасно, підсумувати досвід роботи з античними філософськими текстами та узагальнити своє бачення філософії. Вона, як і будь-яке історико-філософське дослідження, що ставить перед собою філософську мету, виходить за межі суто історичного завдання встановлення усіх деталей минулого в межах його всесторонньої і безсторонньої реконструкції. \n' +
          'Зрозуміло, що книга, написана з таких позицій, не обмежується викладом «поглядів» античних філософів: за улюбленим висловом її автора вона покликана не лише інформувати, а й формувати. Розповідаючи про античну філософію як історичний феномен, твір пропонує читачу авторське розуміння філософії і, що можливо є найважливішим, спосіб прочитання філософських (і не тільки античних) текстів. \n' +
          'Книга вперше презентує наукову спадщину видатного філософа антикознавця українською мовою.',
        imgUrl: 'http://newacropolis.org.ua/uploads/production/ckeditor/picture/data/ecb/9ab/01-/ecb9ab01-509c-463f-93a4-952449177c68/content.png',
        price: 365,
        buyButton: true,
        buyLink: 'here will be the link'
      },
      {
        id: 6,
        isbn: '978-966-97200-1-6',
        title: 'Філософія для життя',
        subtitle: '',
        author: 'Делія Стейнберг',
        year: 2014,
        language: 'українська',
        translatedFrom: 'іспанської',
        pageNumber: 0,
        description: 'Делія Стейнберг зуміла екстрагувати все найкраще з Історії світової Філософії, з якою так добре обізнана. Отож, в її словах чутно відгомін її улюбленного автора Марка Аврелія, філософа-стоїка, що відкрив для нас універсальний закон, який пульсує в зоряному небі, що багато сторіч потому виклав іншими словам Кант. Подеколи її войовниче обстоювання свободи індивіда та його соціальної відповідальності нагадує нам мудрість давнього Китаю, що її виписав Конфуцій... Також ми ознайомлюємося з кращим спадком мудрих пресократиків, які неодмінно покликаються на Природу та їх тайнощі... \n' +
          'Тверда й ґрунтовна основа гарантує синтетичність цієї праці, що її нам пропонує Делія, разом з її тривалим досвідом діалогу та спілкування з різними людьми в різних краях світу, які мали нагоду слухати її курси та лекції.',
        imgUrl: 'http://newacropolis.org.ua/uploads/production/ckeditor/picture/data/1ad/72b/5f-/1ad72b5f-2feb-4003-9a02-5bdcb1f5765b/content.png',
        price: 150,
        buyButton: true,
        buyLink: 'here will be the link'
      },
      {
        id: 7,
        isbn: '978-966-97200-0-9',
        title: 'Ігри Майї',
        subtitle: '',
        author: 'Делія Стейнберг',
        year: 2012,
        language: 'українська',
        translatedFrom: 'іспанської',
        pageNumber: 0,
        description: '«Ігри Майї» – невелика й лаконічна в суто філософічному сенсі, але нескладна і приступна книга.  \n' +
          'Ця книга прислужиться читачеві для «грання в Життя», допоможе уникнути зайвих страждань і поставити собі природні, найголовніші питання, що, як ми вже казали, линуть у Небо, мов дим прадавніх кадил, мов тисячолітня молитва, повторювана новими устами саме в той час, коли Світ спраглий Віри, Щирості та Життєрадісності.',
        imgUrl: 'http://newacropolis.org.ua/uploads/production/ckeditor/picture/data/0da/757/9c-/0da7579c-0628-4650-ac1b-ef5d741c19a5/content.png',
        price: 150,
        buyButton: true,
        buyLink: 'here will be the link'
      },
      {
        id: 8,
        isbn: '978-966-96943-9-3',
        title: 'Алхімік',
        subtitle: 'До образу Джордано Бруно',
        author: 'Хорхе Анхель Ліврага',
        year: 2011,
        language: 'українська',
        translatedFrom: 'іспанської',
        pageNumber: 0,
        description: 'На тлі подій XVI століття, коли панує інквізиція, розгортається доля молодого вченого. Він опиняється у таємній ложі, де вивчає алхімію і опановує таємниці внутрішньої трансформації. У пошуках мудрості головний герой подорожує Сходом і нарешті зустрічає великого майстра Джордано Бруно.   \n' +
          'Це філософський роман про мистецтво пізнання себе, про велич і стійкість людського духу. Чи зможе Алхімік гідно продовжити справу Вчителя? \n' +
          'Минуле і сучасність органічно переплелися у романі, нагадуючи про споконвічну істину: «Кожен кінець є одночасно початком».',
        imgUrl: 'http://newacropolis.org.ua/uploads/production/ckeditor/picture/data/1c7/91c/2e-/1c791c2e-ef2a-46a1-8dee-224d91052288/content.png',
        price: 150,
        buyButton: true,
        buyLink: 'here will be the link'
      },
      {
        id: 9,
        isbn: '978-966-96943-8-6',
        title: 'Ностальгия по вечности',
        subtitle: '',
        author: 'Антон Мусулин',
        year: 2008,
        language: 'російська',
        translatedFrom: 'мовою оригінала',
        pageNumber: 0,
        description: 'Книга представляет собой сборник статей и лекций основателя Ассоциации «Новый Акрополь» в Украине, Антона Мусулина. Автор размышляет над извечными вопросами, исследует богатое наследие философской мысли человечества, открывает многогранный мир символов. Творческое исследование символического объединено с фундаментальным философским дискурсом. Книга обращена ко всем, кого интересует философия, как поиск смыслов, как любовь к мудрости, как практический образ жизни.',
        imgUrl: 'http://newacropolis.org.ua/uploads/production/ckeditor/picture/data/5c1/24c/35-/5c124c35-3da1-41d4-ac86-696287f7a6a5/content.png',
        price: 0,
        buyButton: false,
        buyLink: ''
      },
      {
        id: 10,
        isbn: '966-96463-1-6',
        title: 'Пес на ім’я Моассі',
        subtitle: '',
        author: 'Хорхе Анхель Ліврага',
        year: 2005,
        language: 'українська',
        translatedFrom: 'іспанської',
        pageNumber: 0,
        description: 'У цьому творі професор Ліврага звертається до проблем нашого часу. Він аналізує зловживання владою, несправедливість, протиріччя минулого століття, і водночас закликає ввійти в ХХІ століття з більш незалежними поглядами. У «Пес на ім’я Моассі» ми зустрічаємо критичний погляд у формі фантастичної розповіді. Головним героєм є пес, який отримавши тіло людини, але в душі залишившись собакою, дивиться з властивою йому простотою логіки на ірраціональні моменти людського суспільства.',
        imgUrl: 'http://newacropolis.org.ua/uploads/production/ckeditor/picture/data/d48/688/88-/d4868888-9f4b-4d4e-9af1-2b9889cdc204/content.png',
        price: 0,
        buyButton: false,
        buyLink: ''
      },
      {
        id: 11,
        isbn: '966-96463-0-8',
        title: 'Герой повсякденності',
        subtitle: '',
        author: 'Делія Стейнберг',
        year: 2004,
        language: 'українська',
        translatedFrom: 'іспанської',
        pageNumber: 0,
        description: 'Книга являє собою збірку філософських есеїв Делії Стейнберг Гусман, відомого філософа, письменниці, музиканта, президента міжнародної філософської школи «Новий Акрополь», що має на меті відродження філософії як способу життя. \n' +
          'Сучасна людина – це маленький герой, якому доводиться щоденно вступати у битви, проходити випробування, вирішувати проблеми. Про те, що може допомогти йому, міркує авторка.',
        imgUrl: 'http://newacropolis.org.ua/uploads/production/ckeditor/picture/data/20c/753/68-/20c75368-f53b-40c7-a84d-e2fd59cad278/content.png',
        price: 0,
        buyButton: false,
        buyLink: ''
      },
      {
        id: 12,
        isbn: '5770792043',
        title: 'О героическом энтузиазме',
        subtitle: '',
        author: 'Джордано Бруно',
        year: 1996,
        language: 'російська',
        translatedFrom: 'італійської',
        pageNumber: 0,
        description: 'Исповедь великого философа — реформатора XVI века, чей огонь духа осветил на несколько столетий средневековую Европу, посвящена любви, любви к Истине как движущей силе философского поиска и жизненного подвига Джордано Бруно. Для широкого круга читателей.',
        imgUrl: 'http://newacropolis.org.ua/uploads/production/ckeditor/picture/data/fe3/9c0/21-/fe39c021-6614-4d34-b35a-1a882263d605/content.png',
        price: 50,
        buyButton: true,
        buyLink: ''
      },
      {
        id: 13,
        isbn: '5770777427',
        title: 'Великое Делание',
        subtitle: 'Теория и символы Алхимии',
        author: 'Пуассон А. и др.',
        year: 1995,
        language: 'російська',
        translatedFrom: 'французької, німецької, румунської',
        pageNumber: 0,
        description: 'Покров тайны, окутывающий древнее Герметическое Искусство, ключи понимания которого были утеряны за века материализма и увлечения технологическим процессом, дают повод для скепсиса и недоверия. Делается попытка приподнять завесу, познакомив читателя с основными положениями Алхимии и предоставив для этого слово выдающимся европейским исследователям и мыслителям XIX и XX века: Альберту Пуассону, Николаю Морозову, Мирча Элиаде, Фернанду Шварцу, Карлу Густаву Юнгу. Книга адресована широкому кругу читателей.',
        imgUrl: 'http://newacropolis.org.ua/uploads/production/ckeditor/picture/data/a1d/5a0/f4-/a1d5a0f4-8ac3-43d0-88bb-650945441af6/content.png',
        price: 70,
        buyButton: true,
        buyLink: ''
      }
    ];
    return { books };
  }
}
